[
  {
    "team_id": "721",
    "team": "Air Force",
    "name": "Stacy McIntyre",
    "title": "Head Women's Basketball Coach",
    "url": "https://goairforcefalcons.com/sports/womens-basketball/roster/coaches/stacy-mcintyre/2619",
    "season": "2025-26",
    "text": "A 20-plus year professional of growing leaders through basketball, Stacy McIntyre enters her second season as head coach of Air Force Women’s Basketball in 2025-26. McIntyre was announced as the ninth head coach of Air Force Women’s Basketball on Apr. 25, 2024, assuming the role after spending the previous nine seasons as an assistant under Chris Gobrecht and most recent five as associate head coach.\n\nSince arriving at USAFA, McIntyre has proven instrumental in laying the foundation that has facilitated Air Force's upward trajectory of the past 10 seasons - The most successful stretch of Falcon women's basketball in the program's Division I history.\n\nIn her first year at the head of the Falcon bench, Air Force closed on 2024-25 with an 18-15 record, marking the most wins by a Falcon head coach in their first season in the program’s history. Air Force opened the season at 10-2, earning the program’s first-ever 10-win non-conference and best start to a season since 1991-92. The Falcons, earning a seven seed in the 2025 Mountain West Championships, defeated No. 10 Utah State in the opening round before falling in the MW quarterfinals. McIntyre and Air Force bookended the 2025 season earning the program’s second-ever bid into the WNIT and hosting a postseason game in Clune Arena for the first time ever.\n\nIn 2023-24, McIntyre and the Air Force staff led the Falcons to a 15-17 finish, going 8-10 against the Mountain West. The Falcons went 10-6 in Clune Arena, marking the second season in three years of 10 or more home victories. Air Force has 30 wins the past three seasons which accounts for more home victories than the prior 10 seasons combined.\n\nAir Force's season successes were underscored by the sudden prominence of All-Mountain West selection Milahnie Perry, who, with 535 points scored in 2023-24, became the single-season points record holder in Air Force Division I history. A sure sign of what the future holds, freshmen pair Keelie O'Hollaren and Mountain West All-Freshman honoree Jayda McNabb both left their marks in the freshman records, as O'Hollaren earned the most three-pointers for a freshman in Air Force history (60), and McNabb the most rebounds for a newcomer in the program's Division I history (201). The Falcons closed the year leading the Mountain West in steals per game (10.8, 19 nationally), turnover margin (4.41, 25th nationally), turnovers forced per game (19.19) and three-point production through conference play (.350).\n\nIn 2022-23, the Falcons closed their season at 13-18 with an 8-10 mark against the Mountain West and a 9-5 home record. A 5-1 start to the season in Clune marked a start to the Falcons' home schedule which had not been achieved since the program's final year as a member of Division II in 1995-96, in which Air Force started 7-1 at home.\n\nMcIntyre and the Air Force staff helped guide the Falcons to a record-breaking season in 2021-22. Air Force crafted its most successful campaign in the program's Division I history, as the Falcons' 19 overall wins and 11 Mountain West victories were both program bests. Cierra Winters was named Mountain West Defensive Player while Riley Snyder was named All-Mountain West enroute to becoming Air Force's all-time leading Division I scorer. Air Force clinched its first-ever bye in the Mountain West Tournament where the Falcons defeated Nevada to advance to the semifinal round for the first time in program history. Air Force eventually was awarded an at-large berth in the Women's National Invitational Tournament, as the Falcons picked up their first-ever postseason tournament win in the opening round, defeating San Francisco 64-60.\n\nUnder the guidance of McIntyre, the 2020-21 season was highlighted by Snyder's All-MW Honorable Mention nod and Kassady Huffman's MW All-Defensive team selection. The Falcons finished the shortened 2020-21 campaign with an 8-18 overall record and a 4-14 mark in the Mountain West, finishing ninth in the league. The Falcons made it to the MWC quarterfinals for the second-straight season, defeating SDSU in the first round and falling to top-seeded New Mexico thereafter.\n\nIn the 2019-2020 season McIntyre helped the women's basketball team to new heights as the Falcons finished 10-21 (7-11 MWC), marking the most single-season wins since joining Air Force and the program's most single-season conference wins since joining the Mountain West in 1999-00. Air Force's seventh-place finish in the league tied its best-ever conference finish in the Mountain West and is the best-ever finish since the MWC became an 11-team league.\n\nUnder McIntyre's guidance, the Falcons averaged a program-best 60.7 points per game in league play, marking the team's best conference scoring average during its Mountain West tenure. Air Force also ranked as high as 11th in the nation in offensive rebounds per game and as high as 25th in the nation in steals. Air Force's historic season was also highlighted by knocking off regular-season champions, Fresno State, at the Academy. The Bulldogs, who were undefeated in conference (15-0) at the time of the loss, had never lost to Air Force before. McIntyre also helped guide Air Force to its first-ever win in New Mexico's \"The Pit\", snapping a 22-game losing streak at New Mexico, as well as the squad's first-ever win against Nevada in Reno, snapping an eight-game losing streak at Nevada.\n\nPrior to breaking the ceiling in 2021-22, McIntyre's most recent successes were preceded by a record-breaking 2017-18 campaign, where she helped guide Air Force to five wins in conference, becoming the most by the program in the Mountain West era, surpassing the previous mark of four wins, set in 2005-06 and 2007-08. Air Force's signature win came in the regular season home finale, posting a 57-47 win over then-first place Wyoming. In addition to winning four of the last six games of the season, Air Force smashed five team records, highlighted by a staunch defense that only allowed 62.3 ppg in the regular season and 59.7 pp in league action, setting new team records in each respective category. The Falcons held opponents below 60 points 11 times on the season, testament to the progression of the defense under the coaching staff. Air Force's 2017-18 season also yielded six new individual school records including the program's first-ever Mountain West Freshman of the Year in Kaelin Immel, who set four program-records highlighted by the most-ever points scored by an Air Force freshman in the Div. I era.\n\nMcIntyre continued to push the envelope in 2018-19, leading a team that averaged 60.1 points per game in regular season and Mountain West play, an average mark 4.4 points more than last season's averages and 12.7 more points per game than in their inaugural campaign. McIntyre helped a young Falcon squad check the boxes on numerous milestones to include the team's first win against Army in over a decade and ending a 13-game losing streak to in-state rivals Colorado State. Snyder, who averaged 10 points per game, was a Mountain West All-Freshman team honoree. She is the third freshman since the 2017-18 season to earn the honor.\n\nMcIntyre worked with former Gobrecht at two stops prior to arriving at the Academy. In addition to one season with her at Yale, McIntyre was part of Gobrecht's staff at the University of Southern California for seven seasons. McIntyre has previous ties to the Mountain West, spending three years as an assistant coach at the University of Nevada.\n\nIn her time at USC, McIntyre assisted in all facets of game preparation, oversaw NCAA compliance matters and was involved in all aspects of recruiting student-athletes. Her efforts helped assemble a pair of Top-10 recruiting classes that included Ebony Hoffman and Eshaya Murphy, who were taken in the first and second round of the WNBA draft, respectively. McIntyre also helped the program to a pair of postseason appearances in 2000 and 2002.\n\nMcIntyre began her coaching career at Nevada where she oversaw all aspects of the recruiting process and oversaw the team travel and recruiting budgets for the Wolfpack. McIntyre also has experience working with the Nike Women's Basketball Skills Academy where she oversaw all event and facility planning.\n\nMcIntyre enjoyed a standout career at the University of Kentucky and finished her career ninth all-time in scoring (1,215) and sixth in steals (189). A two-time captain, she led the team in scoring twice and was named to the All-SEC Second Team and was an All-Academic SEC selection in 1992. McIntyre also led the Wildcats to the NCAA Tournament in 1991.\n\nIn 2018, she was inducted into the 11th Annual Scott County Athletics Hall of Fame class. McIntyre is a celebrated two-sport athlete from Georgetown, Kentucky's Scott County High School, where she played from 1984-1988.\n\nMcIntyre graduated from Kentucky in 1994 with a Bachelor of Arts in Education and obtained a teacher's certificate."
  },
  {
    "team_id": "721",
    "team": "Air Force",
    "name": "Adam Wardenburg",
    "title": "Associate Head Women's Basketball Coach",
    "url": "https://goairforcefalcons.com/sports/womens-basketball/roster/coaches/adam-wardenburg/2620",
    "season": "2025-26",
    "text": "Air Force women's basketball and first-year head coach Stacy McIntyre announced the addition of Adam Wardenburg as the Falcons' newest Associate Head Coach, the program announced on June 5, 2024.\n\nSporting a 12-year career in college basketball, Wardenburg brings a resume to the Air Force office that is indicative of success at various levels of the game.\n\n\"On behalf of the entire Air Force Women's Basketball program, I am thrilled to welcome Adam Wardenburg to our coaching staff,\" McIntyre said. Adam's expertise and passion for the game will undoubtedly elevate our team to new heights. We are excited to have him join our Falcon family and look forward to the incredible impact he will make on our players both on and off the court.\"\n\nWardenburg arrives at the Academy after a second stint at Utah Valley, where he held the same title. In Wardenburg's 2023-24 at UVU, he was key in implementing a zone defense for the Wolverines that finished ninth nationally in steals per game (11.2) and tenth in bench points (27.8) - both league-leading statistics. Utah Valley also led the WAC in turnovers forced per game (19.86) and finished second in scoring defense (65.5). In 2023-24, Utah Valley improved upon its previous season by four wins, one of which included an overtime victory over eventual WAC champion California Baptist (92-89, Feb. 15). Wardenburg previously served as an assistant coach and offensive/recruiting coordinator for UVU from 2014-18, where his program made two appearances in the semifinal round of the WAC Tournament.\n\nWardenburg, in between both stretches at Utah Valley, served as head coach for both men's and women's programs at Southern Virginia, heading up the Knights' men's program from 2019-2023 and serving one year at the helm of the women's team in 2018-19. His one season with the Southern Virginia women yielded an all-time magnitude of success for the Knights' program, as Wardenburg was named D3hoops.com Mid-Atlantic Coach of the Year after leading the team on its most successful season ever (21-6). During his tenure with the men, Wardenburg's teams earned two of its best finishes in the program's current Division III era, had players set records in scoring average, shots made and assists, and facilitated an increase in team grade point average from 2.73 to 3.45.\n\nPrior to initially joining the Utah Valley staff in 2014, Wardenburg got his start serving as an assistant with the College of Southern Idaho's women's team in 2013-14 where he was part of a staff that went 29-4, won a Region 18 Tournament title, and advanced to the NJCAA National Tournament. Wardenburg also served two seasons at Utah State on staff as Director of Operations (2011-13).\n\nWardenburg earned a bachelor's degree from alma mater Utah State in 2013 and received a Master's of Business Administration from Western Governors University in 2016. Wardenburg and his wife Tristan are the parents of three daughters, Blakely, Emery, Indie, and a son, Brooks."
  },
  {
    "team_id": "721",
    "team": "Air Force",
    "name": "Rynae Rasley",
    "title": "Assistant Coach",
    "url": "https://goairforcefalcons.com/sports/womens-basketball/roster/coaches/rynae-rasley/2621",
    "season": "2025-26",
    "text": "First-year Air Force Women’s Basketball head coach Stacy McIntyre’s coaching roster continues to take shape, as the program announced the return of Rynae Rasley to the Falcon staff on June 27.\n\nNo stranger to the nuances of intercollegiate athletics at the Air Force Academy, Rasley served formerly as an assistant of three years under Chris Gobrecht (2016-19), followed by five as the head coach at the Air Force Academy Preparatory School.\n\n“I’m excited to be back on the hill and part of this new journey with our Falcons,” said Rasley. I want to thank Stacy McIntyre for the opportunity to join her staff and the honor to continue coaching some of our country’s finest young women.”\n\n\"I’m excited to welcome Rynae back to the Academy and our women’s basketball program,” coach McIntyre said of the newest member of her inaugural staff. “She understands the Academy and our brand of basketball, has experience at multiple levels of our game, and knows many of these cadets that currently play for us. We are fortunate to have her back among us.”\n\nWith two former USAFA Prep players from Rasley’s 2022-23 lineup currently rostered (Marissa Hargrave, Jayda McNabb), her influence on a young-yet-hardened 2024-25 Air Force squad was felt felt early and often. In total, Rasley’s four-year stint leading the prep school program produced seven Falcons worthy of a roster spot which accounted for 65 individual starts and left their mark on the Air Force record book – including McNabb’s all-time freshman season in which she finished with the most rebounds in Air force freshman history and top-five in both steals and blocks among similar company.\n\nRasley’s initial stint under coach Gobrecht represents the beginning of an upward trajectory for Air Force which has led the program into its current, most competitive chapter in nearly two decades of Air Force Division I basketball. In 2017-18, Air Force took its first steps forward, resetting the benchmark with five wins against Mountain West opponents, including a marquis 57-47 victory in Clune Arena over then-first place Wyoming in the Falcons’ home finale (Feb. 27, 2018). Since then, Air Force has not looked back, winning 42 contests against league opponents and finishing ninth or better in six of the previous seven seasons. The Falcons claimed five team records that year, highlighted by a defensive effort which yielded only 62.3 ppg in the regular season and 59.7 ppg against Mountain West opponents, resetting team season bests in both respective categories. Air Force held opponents below 60 points 11 times on the season, testament to the progression of the defense under the coaching staff. Air Force's 2017-18 season also yielded six new individual school records including the program's first-ever Mountain West Freshman of the Year in Kaelin Immel, who set four program records highlighted by the most-ever points scored by a Falcon in the program’s Division I era.\n\nBefore her initial stint at the Academy, Rasley served three seasons as an assistant at Nyack College in New York (Division II). While there, she oversaw elements of recruiting, team travel, budgeting, skill development and community outreach for the program, while also developing and executing the Warriors’ strength and conditioning program.\n\nThe Falcons’ newest staff addition kicked off her career serving as an assistant coach at The City College of New York in West Harlem. There, she was responsible for player skill development, strength training, scheduling, and recruiting.\n\nRasley began her college basketball career at Chandler-Gilbert Community College (Chandler, Ariz.). Rasley led CGCC to back-to-back Regional One Division II championships as the Coyotes ranked 7th and 13th, respectively, in the nation throughout her junior college career.\n\nRasley transferred to City College in 2008 and concluded her playing career after averaging a double-double. She was also a competitor on the outdoor track & field teams and was named a CUNYAC all-star in 2011. Rasley wrapped her City College playing career earning a Bachelor of Arts there in 2011, followed by the completion of an M.S. in Organizational Leadership at Nyack College in 2015."
  },
  {
    "team_id": "721",
    "team": "Air Force",
    "name": "Lauren Brocke",
    "title": "Assistant Coach, Recruiting Coordinator",
    "url": "https://goairforcefalcons.com/sports/womens-basketball/roster/coaches/lauren-brocke/2622",
    "season": "2025-26",
    "text": "Lauren Brocke, serving in her third season at the Academy in 2025-26, acts as forwards/post coach and both recruiting and equipment coordinator while additionally serving as the program’s compliance liaison.\n\nIn her second season at Air Force, Brocke and Air Force collectively closed 2024-25 with an 18-15 record, earning Air Force’s second winning season in the program’s Division I history. The Falcons opened the season at 10-2, earning the program’s first-ever 10-win non-conference and best start to a season since 1991-92. The Falcons, earning a seven seed in the 2025 Mountain West Championships, defeated No. 10 Utah State in the opening round before falling in the MW quarterfinals. Air Force bookended the 2025 season earning the program’s second-ever bid into the WNIT and hosting a postseason game in Clune Arena for the first time ever.\n\nLauren Brocke was announced to the Air Force women’s basketball staff on June 21, 2023, following a two-year stint as assistant coach at Colorado College under head coach Katherine Menendez. In her time at CC, the Tigers compiled a 19-8 record in 2022-23 which included a 14-2 clip against SCAC opponents and a 70-64 win over No. 1 Trinity University (Feb. 5). The 19-8 record was Colorado College's best season record since 1980-81 in which the Tigers finished at 20-8.\n\nWhile at CC, Brocke's areas of responsibility included recruiting, player development, scouting, community service, leadership training, team travel coordination and managing the program's social media accounts. On the development side, one of Brocke's many notables included working with guard Anna Fanelli, who led Division III in assists in 2021-22.\n\nBrocke served as a member of the support staff for Team USA in the summer of 2022, assisting with the U17 and U18 team trials at the Olympic Training Center in Colorado Springs.\n\nBrocke was a four-year letter winner at Colorado State, playing for the Rams from 2018-2021, earning a Mountain West All-Academic selection in 2019 and serving on the Student-Athlete Advisory Committee. Brocke completed her time at CSU with a bachelor's degree in human resource management and a certificate in entrepreneurship."
  },
  {
    "team_id": "721",
    "team": "Air Force",
    "name": "Kendall Folley",
    "title": "Assistant Coach",
    "url": "https://goairforcefalcons.com/sports/womens-basketball/roster/coaches/kendall-folley/2623",
    "season": "2025-26",
    "text": "Air Force Athletics announced Kendall Folley as the Falcons' newest assistant coach on June 10, 2025.\n\nAir Force represents the first stop in Folley's coaching career. Folley, a 2025 graduate of East Tennessee State with a master's degree in sports management, opened her playing career at Oakland in 2021-22 before transferring and playing her remaining three at ETSU. While there, Folley was a three-year starter and team captain her junior and senior seasons. Folley capped a four-year playing resume having earned a 2025 SoCon All-Tournament selection, All-Conference and All-Defensive honors in 2022-23 and was a 2022 Horizon League All-Freshman honoree in her one season at Oakland. Folley's teams from 2021-25 combined for a 65-50 record; All three of her seasons with ETSU bore winning records, topped by a 25-10 showing for her Bucs in Folley's sophomore season.\n\nOff the court, Folley had served the previous year as a student intern in the ETSU women's basketball office. She has extensive experience in running camps, serving the last two seasons in ETSU's summer camp programs and the Lebanon (Ohio) High School camp in 2021. During her time at ETSU, Folley was heavily involved in establishing community outreach for her team, such as spending time volunteering for Veteran Affairs and helping organize back-to-school events.\n\n\"I'm thrilled to welcome Kendall Folley to our coaching staff,\" said McIntyre. \"Her leadership and high basketball IQ shaped by a successful playing career at ETSU make her a tremendous addition to our program. We're excited for the impact she'll have on our cadet-athletes both on and off the court.\"\n\nFolley is from Lebanon, Ohio, and is the daughter of father Robert Folley and mother Beth Reed and has two sisters, Nyilah and Kaylee."
  }
]